chipskiller/ahrs_test/GD32F3x0_Firmware_Library_V2.6.0/GD32F3x0_Firmware_Library_V2.6.0/GD32F3x0_Firmware_Library_V2.6.0/Template/main.c
#include "main.h"
#include "communicate_protocol.h"
#include "gd32f3x0.h"
#include "hard_i2c.h"
#include "math.h"
#include "ota_protocol.h"
#include "stdio.h"
#include "string.h"
#include "systick.h"
#include <stdint.h>

/* ========== 禁用半主机（semihosting）==========
   标准 C 库的 printf 首次调用会走 semihosting（执行 BKPT 0xAB
   请求调试器服务）， 没有调试器连接时触发 HardFault（HFSR.DEBUGEVT=1）。
   __use_no_semihosting 让链接器改用不含半主机的库版本，并保留浮点 %f 支持。 */
#pragma import(__use_no_semihosting)
struct __FILE {
  int handle;
};
FILE __stdout;
void _sys_exit(int x) { x = x; }
void _ttywrch(int ch) { (void)ch; }

/* ========== printf 重定向到 USART0 ==========
   禁用半主机后必须自行提供 fputc，否则链接器会用 C 库自带的半主机版 fputc，
   导致 L6915E：__use_no_semihosting 与半主机 fputc 冲突。 */
int fputc(int ch, FILE *f) {
  usart_data_transmit(USART0, (uint8_t)ch);
  while (RESET == usart_flag_get(USART0, USART_FLAG_TBE))
    ;
  return ch;
}

#define delay_ms(x) delay_1ms(x)

/************************ 宏定义区域 ************************/
// I2C设备7位地址
#define ICM42670_ADDR 0x68
#define QMC5883P_ADDR 0x2c

#define I2C_IMU I2C1       // ICM42670挂载I2C1 (PA0/PA1)
#define I2C_MAG I2C1       // 磁力计挂载I2C1
#define USART_RS485 USART1 // RS485上报串口
#define I2C_TIMEOUT 10000U // I2C通信超时计数（与hard_i2c.h保持一致）

// 采样与报警配置
/* 采样周期/频率统一在 main.h 定义（SAMPLING_FREQ_HZ），DT 为其派生值 */
#define MAG_DISTURB_THRESH 120.0f // 地磁突变判定阈值

/* ========== 统计稳定性估计参数（概率统计判静止 + 零偏估计） ==========
   原理：对陀螺原始值做 EMA 均值/方差流式统计（每帧更新）：
   - 均值 st_mean：反映当前零偏（滑动平均）
   - 方差 st_var ：反映波动，方差小=静止，大=运动
   - 方差是对"均值"的波动，与均值绝对值无关 → 免疫温漂方向不对称
   静止判定 = 三轴 σ < SIGMA_STABLE 且 均值残差 < 残差阈值 且 加速度≈1g
   零偏更新 = 向稳定窗口的统计均值 st_mean 收敛（比单帧更抗噪） */
#define STAT_TAU_S 1.5f        /* 统计窗口时间常数(s)：EMA 有效记忆≈3τ */
#define SIGMA_STABLE 0.20f     /* 静止标准差阈值(°/s)：静止时实测σ的3~5倍 */
#define RESID_STABLE 0.70f     /* 均值残差基础阈值(°/s)：均值偏离零偏>此值视为旋转 */
#define RESID_TEMP_COEFF 0.02f /* 残差阈值温度系数(°/s/°C)：温漂残差自适应放宽 */
#define ZRO_TEMP_REF 25.0f     /* 手册零偏参考温度(°C)：温漂系数以25°C为基准 */

/************************ 全局数据结构体 ************************/

// 全局变量
icm_raw_data_t icm_raw;
mag_raw_data_t mag_raw;
attitude_info_t att;
gyro_bias_t gyro_bias;
quaternion_t quat;

uint8_t day_mode = 1;                 // 1=白天6轴模式 0=夜间9轴融合
uint8_t mag_disturb_flag = 0;         // 地磁受大车干扰标记
uint8_t fault_type = 0;               // 偏转报警类型标记
static uint32_t alarm_filter_cnt = 0; // 报警防抖计数器（帧计数，需32位）
uint32_t stable_cnt;
volatile uint8_t imu_loop_flag = 0;  // 定时器中断标志
volatile uint8_t imu_debug_flag = 0; // 调试用标志

#define ARRAYNUM(arr_nanme) (uint32_t)(sizeof(arr_nanme) / sizeof(*(arr_nanme)))
#define TRANSMIT_SIZE (ARRAYNUM(transmitter_buffer) - 1)

uint8_t transmitter_buffer[128] = "\n\rUSART interrupt test\n\r";
uint8_t receiver_buffer[32];
uint8_t transfersize = TRANSMIT_SIZE;
uint8_t receivesize = 32;
__IO uint8_t txcount = 0;
__IO uint16_t rxcount = 0;

/************************ USART0 DMA + 空闲中断接收 ************************/
uint8_t usart0_rx_buffer[USART0_RX_BUF_SIZE];
volatile uint16_t usart0_rx_len = 0;
volatile uint8_t usart0_rx_flag = 0;

/************************ ICM42670 驱动函数 ************************/
/* 软I2C助手函数前向声明（定义在文件后部，供icm42670_init提前调用） */
static void diag_scl(uint8_t level);
static void diag_sda(uint8_t level);
static uint8_t diag_sda_in(void);
static void diag_start(void);
static void diag_stop(void);
static uint8_t diag_send_byte(uint8_t byte);
// static uint8_t diag_read_byte(uint8_t ack_bit);  /* 诊断用，已注释 */
static void diag_reg_write(uint8_t dev, uint8_t reg, uint8_t data);
/**
 * @brief ICM42670芯片初始化
 * @note
 * 硬件I2C对0x75(WHO_AM_I)读会时钟拉伸挂起（软I2C诊断已确认器件正常，ID=0x67），
 *       故此处改用软I2C写配置寄存器，配完后恢复硬件I2C引脚供主循环读数据。
 */
void icm42670_init(void) {
  printf("ICM42670 init: via soft-I2C ...\r\n");

  /* 切换到软I2C（GPIO开漏）模式 */
  gpio_mode_set(GPIOA, GPIO_MODE_OUTPUT, GPIO_PUPD_PULLUP,
                GPIO_PIN_0 | GPIO_PIN_1);
  gpio_output_options_set(GPIOA, GPIO_OTYPE_OD, GPIO_OSPEED_50MHZ,
                          GPIO_PIN_0 | GPIO_PIN_1);
  diag_scl(1);
  diag_sda(1);
  delay_1ms(2);

  diag_reg_write(0x68, 0x1F, 0x00);
  delay_ms(100);

  diag_reg_write(0x68, 0x1F, 0x0F);
  delay_ms(30);

  /* 传感器配置（Bank0 直接寄存器，无需 MREG 间接访问）
     GYRO_CONFIG0  (0x20) = 0x65 : FS=±250dps(11) + ODR=1.6kHz(0101)
     ACCEL_CONFIG0 (0x21) = 0x65 : FS=±2g(11) + ODR=1.6kHz(0101)
     GYRO_CONFIG1  (0x23) = 0x34 : LPF=53Hz(100)，保留复位保留位
     ACCEL_CONFIG1 (0x24) = 0x44 : LPF=53Hz(100)，保留复位AVG */
  diag_reg_write(0x68, 0x20, 0x65);
  diag_reg_write(0x68, 0x21, 0x65);
  diag_reg_write(0x68, 0x23, 0x34);
  diag_reg_write(0x68, 0x24, 0x44);

  /* 恢复硬件I2C引脚(AF4)，供主循环/后续硬件I2C使用 */
  gpio_af_set(GPIOA, GPIO_AF_4, GPIO_PIN_0);
  gpio_af_set(GPIOA, GPIO_AF_4, GPIO_PIN_1);
  gpio_mode_set(GPIOA, GPIO_MODE_AF, GPIO_PUPD_PULLUP, GPIO_PIN_0 | GPIO_PIN_1);
  gpio_output_options_set(GPIOA, GPIO_OTYPE_OD, GPIO_OSPEED_50MHZ,
                          GPIO_PIN_0 | GPIO_PIN_1);

  printf("ICM42670 init done\r\n");
}

/**
 * @brief 读取IMU全部原始数据并转换物理量
 */
void icm42670_get_raw_data(void) {
  uint8_t buf[12] = {0};
  i2c_reg_read_multi(I2C_IMU, ICM42670_ADDR, 0x0B, buf, 12);

  int16_t ax_raw = (buf[0] << 8) | buf[1];
  int16_t ay_raw = (buf[2] << 8) | buf[3];
  int16_t az_raw = (buf[4] << 8) | buf[5];
  float ax_val = ax_raw / 16384.0f;
  float ay_val = ay_raw / 16384.0f;
  float az_val = az_raw / 16384.0f;

  if (fabsf(ax_val) > 20.0f || fabsf(ay_val) > 20.0f || fabsf(az_val) > 20.0f) {
    return;
  }

  int16_t gx_raw = (buf[6] << 8) | buf[7];
  int16_t gy_raw = (buf[8] << 8) | buf[9];
  int16_t gz_raw = (buf[10] << 8) | buf[11];
  float gx_val = gx_raw / 131.072f;
  float gy_val = gy_raw / 131.072f;
  float gz_val = gz_raw / 131.072f;

  if (fabsf(gx_val) > 2500.0f || fabsf(gy_val) > 2500.0f ||
      fabsf(gz_val) > 2500.0f) {
    return;
  }
  icm_raw.ax = ax_val;
  icm_raw.ay = ay_val;
  icm_raw.az = az_val;
  icm_raw.gx = gx_val;
  icm_raw.gy = gy_val;
  icm_raw.gz = gz_val;

  uint8_t temp_buf[2] = {0};
  i2c_reg_read_multi(I2C_IMU, ICM42670_ADDR, 0x09, temp_buf, 2);
  int16_t temp_raw = (temp_buf[0] << 8) | temp_buf[1];
  icm_raw.temp = temp_raw / 132.48f + 25.0f;
}

/************************ 磁力计驱动 ************************/
void qmc5883p_init(void) {
  /* Step 1: 软复位 Control(0x0B) bit7=1 */
  i2c_reg_write(I2C_MAG, QMC5883P_ADDR, 0x0B, 0x80);
  delay_ms(100);

  /* Step 2: 退出复位 */
  i2c_reg_write(I2C_MAG, QMC5883P_ADDR, 0x0B, 0x00);
  delay_ms(100);

  /* Step 3: 读 Chip ID 校验 (0x00 = 0x80) */
  uint8_t id = i2c_reg_read(I2C_MAG, QMC5883P_ADDR, 0x00);
  if (id != 0x80) {
    printf("QMC5883P not detected, ID=0x%02X\r\n", id);
  } else {
    printf("got id: 0x%02X\r\n", id);
  }

  /* Step 4: 配置 Control(0x0B) bits3-2=10(±8G), set_and_reset_on
     0x0C = 0b00001100 */
  i2c_reg_write(I2C_MAG, QMC5883P_ADDR, 0x0B, 0x0C);
  delay_ms(10);
  /* Step 5: 配置 Control Register 1 (0x0A): 连续模式 + 200Hz + OSR1=8 + OSR2=2
     0x4F = 0b01001111 */
  i2c_reg_write(I2C_MAG, QMC5883P_ADDR, 0x0A, 0x4F);
  delay_ms(10);
}

/**
 * @brief 读取磁力计原始数据（LSB first），计算地磁模长
 * @note  ±8G 量程下 1LSB = 1/2048 G
 * @note  寄存器 0x00=ChipID, 0x01~0x06=数据, 从 0x01 开始读
 */
void qmc5883p_get_raw_data(void) {
  uint8_t buf[6] = {0};
  i2c_reg_read_multi(I2C_MAG, QMC5883P_ADDR, 0x01, buf, 6);

  /* QMC5883P 小端序: X_L, X_H, Y_L, Y_H, Z_L, Z_H */
  int16_t mx_raw = (buf[1] << 8) | buf[0];
  int16_t my_raw = (buf[3] << 8) | buf[2];
  int16_t mz_raw = (buf[5] << 8) | buf[4];

  mag_raw.mx = mx_raw / 2048.0f; /* 转换为高斯 */
  mag_raw.my = my_raw / 2048.0f;
  mag_raw.mz = mz_raw / 2048.0f;
  mag_raw.mag_norm = sqrtf(mag_raw.mx * mag_raw.mx + mag_raw.my * mag_raw.my +
                           mag_raw.mz * mag_raw.mz);
}

/**
 * @brief 判断地磁是否被大车金属干扰
 */
void mag_disturb_detect(void) {
  static float last_norm = 0;
  float delta = fabsf(mag_raw.mag_norm - last_norm);
  last_norm = mag_raw.mag_norm;
  mag_disturb_flag = (delta > MAG_DISTURB_THRESH) ? 1 : 0;
}

