chipskiller/ahrs_test/GD32F3x0_Firmware_Library_V2.6.0/GD32F3x0_Firmware_Library_V2.6.0/GD32F3x0_Firmware_Library_V2.6.0/Template/main.c
/************************ 陀螺静态零偏自动校准 ************************/
/**
 * @brief 设备静止时自动微调Z轴陀螺零偏，抑制温度漂移
 * 仅保存至内存，不写入Flash，上电重置
 */

/************************ 四元数辅助函数 ************************/
static void quat_normalize(void) {
  float norm = sqrtf(quat.w * quat.w + quat.x * quat.x + quat.y * quat.y +
                     quat.z * quat.z);
  if (norm > 0.0001f) {
    quat.w /= norm;
    quat.x /= norm;
    quat.y /= norm;
    quat.z /= norm;
  }
}

static void euler_to_quat(float pitch_deg, float roll_deg, float yaw_deg) {
  float p = pitch_deg * 0.0174533f * 0.5f; /* θ/2 */
  float r = roll_deg * 0.0174533f * 0.5f;  /* φ/2 */
  float y = yaw_deg * 0.0174533f * 0.5f;   /* ψ/2 */

  float cp = cosf(p), sp = sinf(p);
  float cr = cosf(r), sr = sinf(r);
  float cy = cosf(y), sy = sinf(y);

  /* 标准ZYX四元数（q1=roll分量, q2=pitch分量），与 Mahony 修正和
     四元数→欧拉角提取(vx/vy/vz)的约定保持一致。
     原实现 q1/q2 反了，导致 Mahony 修正方向错误→姿态缓慢漂移→
     累积到总倾斜90°时 roll 提取进入奇异点，跳到±180°来回振荡。 */
  quat.w = cy * cp * cr + sy * sp * sr;
  quat.x = cy * cp * sr - sy * sp * cr;
  quat.y = cy * sp * cr + sy * cp * sr;
  quat.z = sy * cp * cr - cy * sp * sr;

  quat_normalize();
}

/************************ 姿态解算算法 ************************/
/**
 * @brief 姿态解算（四元数版）
 * 内部使用四元数进行姿态更新，避免万向节锁
 * 输出仍然是欧拉角（pitch, roll, yaw_now）
 */
void attitude_calc_6axis(float ax, float ay, float az, float gx, float gy,
                         float gz, float temp) {
  // ====== 阶段0：静态变量（跨调用保持状态） ======
  // 滤波参数由采样周期 SAMPLING_PERIOD_S 派生，首次调用计算一次
  static uint8_t params_inited = 0;
  static float alpha_fast = 0.0f, alpha_very_fast = 0.0f, alpha_very_slow = 0.0f;
  static float ki_gain = 0.0f;
  if (!params_inited) {
    alpha_fast = SAMPLING_PERIOD_S / 0.5f; /* τ=0.5s 中速（静止稳态收敛） */
    alpha_very_fast = SAMPLING_PERIOD_S / 0.1f; /* τ=0.1s 最快（温度突变快修） */
    alpha_very_slow = SAMPLING_PERIOD_S / 3.0f; /* τ=3s 最慢（静止<5s 极慢跟踪） */
    ki_gain = KI_REF * REF_FREQ_HZ * SAMPLING_PERIOD_S; /* 积分速率守恒 */
    params_inited = 1;
  }
  static uint8_t first_run = 1;                // 首次运行标志，触发初始对准
  static float gx_bias = 0.0f, gy_bias = 0.0f; // 陀螺零偏估计值（在线校准）
  static float gx_sum = 0.0f, gy_sum = 0.0f, gz_sum = 0.0f; // 初始对准累加器
  static uint16_t init_cnt = 0;                             // 初始对准采样计数
  static float ix = 0.0f, iy = 0.0f, iz = 0.0f; // Mahony PI 控制器积分项
  static int temp_stable_cnt = 0;               // 温度稳定计数器
  static float last_temp = 0;                   // 上次温度值
  static int temp_diff_flag = 0;                // 温度变化标志
  static int stable_cnt_2 = 0;                  // 静止时段计数（区分 τ=1s/τ=0.5s 阶段）
  static float st_mean[3] = {0.0f, 0.0f, 0.0f}; // 陀螺原始值 EMA 均值（统计零偏估计，每帧更新）
  static float st_var[3] = {0.0f, 0.0f, 0.0f};  // 陀螺原始值 EMA 方差（统计波动，每帧更新）
  static uint8_t stat_inited = 0;               // 统计初始化标志（首次用当前值作均值起点）
  // ====== 阶段1：初始对准（约5秒，帧数由采样频率派生） ======
  if (first_run) {
    gx_sum += gx;
    gy_sum += gy;
    gz_sum += gz;
    init_cnt++;

    if (init_cnt >= FRAMES_5S) { // 5秒初始对准（帧数由采样频率派生）
      // FRAMES_5S 次采样完成，求均值作为陀螺静态零偏
      gx_bias = gx_sum / (float)FRAMES_5S;
      gy_bias = gy_sum / (float)FRAMES_5S;
      gyro_bias.gz_bias = gz_sum / (float)FRAMES_5S;
      gyro_bias.temp_ref = temp;
      last_temp = temp;
      // 用加速度计计算初始姿态角，初始化四元数（yaw=0）
      float accel_pitch = atan2f(-ax, sqrtf(ay * ay + az * az)) * 57.3f;
      float accel_roll = atan2f(ay, az) * 57.3f;
      euler_to_quat(accel_pitch, accel_roll, att.yaw_now);

      first_run = 0;
    } else {
      // 初始化未完成，仅输出加速度计姿态，不积分
      float accel_pitch = atan2f(-ax, sqrtf(ay * ay + az * az)) * 57.3f;
      float accel_roll = atan2f(ay, az) * 57.3f;
      att.pitch = accel_pitch;
      att.roll = accel_roll;
      att.yaw_now = att.yaw_now;
      return;
    }
  }

  // ====== 阶段2：陀螺零偏补偿 ======
  float gx_comp = gx - gx_bias;
  float gy_comp = gy - gy_bias;
  float gz_comp = gz - gyro_bias.gz_bias;

  // ====== 阶段2.5：统计稳定性估计（EMA 均值 + EMA 方差） ======
  // 对陀螺原始值做流式统计（每帧更新，不是固定值）：
  //   - st_mean 向新样本靠拢 α（滑动平均，跟踪当前零偏）
  //   - st_var  向偏差平方靠拢 α（滑动方差，反映波动）
  // 增量式 EMA 含"泄放项"，数学上有界、收敛，不会越加越大。
  // 首次调用用当前值作均值起点，避免从 0 缓慢爬升。
  {
    float g_raw[3] = {gx, gy, gz};
    if (!stat_inited) {
      st_mean[0] = gx; st_mean[1] = gy; st_mean[2] = gz;
      stat_inited = 1;
    }
    float sa = SAMPLING_PERIOD_S / STAT_TAU_S; /* α = DT/τ */
    for (int i = 0; i < 3; i++) {
      float d = g_raw[i] - st_mean[i];
      st_mean[i] += sa * d;                    /* 均值：向样本靠拢 α */
      st_var[i]  += sa * (d * d - st_var[i]);  /* 方差：向 d² 靠拢 α（有界） */
    }
  }

  // ====== 阶段3：静止判定（统计稳定 + 均值残差 + 加速度辅助） ======
  // 1) 统计稳定：三轴标准差 σ < SIGMA_STABLE（波动小 → 静止）
  // 2) 均值残差：统计均值与当前零偏差 < 残差阈值（防匀速旋转被当静止；
  //    残差阈值随温度自适应放大，防温漂残差卡死零偏更新）
  // 3) 加速度模长 ≈1g（排除线性加速度/振动）
  static int32_t stable_cnt = 0; // 连续静止采样计数（必须带符号，否则 -- 下溢）
  float acc_norm_stable =
      sqrtf(ax * ax + ay * ay + az * az); // 加速度模长辅助判静止
  float resid_thresh = RESID_STABLE +
                       RESID_TEMP_COEFF * fabsf(temp - ZRO_TEMP_REF);
  uint8_t is_stat_stable =
      (st_var[0] < SIGMA_STABLE * SIGMA_STABLE) &&
      (st_var[1] < SIGMA_STABLE * SIGMA_STABLE) &&
      (st_var[2] < SIGMA_STABLE * SIGMA_STABLE);
  uint8_t is_bias_aligned =
      (fabsf(st_mean[0] - gx_bias) < resid_thresh) &&
      (fabsf(st_mean[1] - gy_bias) < resid_thresh) &&
      (fabsf(st_mean[2] - gyro_bias.gz_bias) < resid_thresh);
  uint8_t is_stable = is_stat_stable && is_bias_aligned &&
                      (acc_norm_stable > 0.95f && acc_norm_stable < 1.05f);
  // printf("stable_cnt=%d, is_stable=%d, gx_comp=%.2f, gy_comp=%.2f,
  // gz_comp=%.2f\r\n", stable_cnt, is_stable, gx_comp, gy_comp, gz_comp);
  if (is_stable) {
    stable_cnt++;
  } else {
    /* 滞回：每帧不稳减 5 帧（FRAMES_5S×0.001），1帧不稳≈5帧静止；
       5000 帧累计约需 1s 连续不稳才清零，容忍偶发抖动 */
    stable_cnt -= (int32_t)(FRAMES_5S * 0.001f);
    if (stable_cnt < 0) {
      stable_cnt = 0;
    }
    // 运动时衰减 Mahony 积分项，防止积分饱和（INTEGRAL_DECAY 预计算常量）
    ix *= INTEGRAL_DECAY;
    iy *= INTEGRAL_DECAY;
    iz *= INTEGRAL_DECAY;
  }

  // ====== 阶段4：陀螺积分 → 四元数增量（一阶龙格库塔法） ======
  float q0 = quat.w, q1 = quat.x, q2 = quat.y, q3 = quat.z;

  // ====== 阶段4.1：反演锁死检测与恢复 ======
  // 若估计重力 v 与实测重力 a 方向相反（点积<0），说明滤波器锁死在 180°
  // 倒立解（ 叉积误差在 180°
  // 处为0，拉不回来）。此时用加速度计重新初始化四元数，立即拉回正确姿态。
  // 仅当加速度模长≈1g 时判定，避免剧烈运动误触发。
  {
    float acc_norm_chk = sqrtf(ax * ax + ay * ay + az * az);
    if (acc_norm_chk > 0.9f && acc_norm_chk < 1.1f) {
      float ax_n = ax / acc_norm_chk, ay_n = ay / acc_norm_chk,
            az_n = az / acc_norm_chk;
      float vx_c = 2.0f * (q1 * q3 - q0 * q2);
      float vy_c = 2.0f * (q0 * q1 + q2 * q3);
      float vz_c = q0 * q0 - q1 * q1 - q2 * q2 + q3 * q3;
      if (vx_c * ax_n + vy_c * ay_n + vz_c * az_n < 0.0f) {
        /* 反演锁死：用加速度计重新初始化四元数，保持当前 yaw */
        float accel_pitch = atan2f(-ax, sqrtf(ay * ay + az * az)) * 57.3f;
        float accel_roll = atan2f(ay, az) * 57.3f;
        euler_to_quat(accel_pitch, accel_roll, att.yaw_now);
        ix = 0.0f;
        iy = 0.0f;
        iz = 0.0f; /* 清积分项 */
        q0 = quat.w;
        q1 = quat.x;
        q2 = quat.y;
        q3 = quat.z; /* 用新四元数继续 */
      }
    }
  }

