chipskiller/ahrs_test/GD32F3x0_Firmware_Library_V2.6.0/GD32F3x0_Firmware_Library_V2.6.0/GD32F3x0_Firmware_Library_V2.6.0/Template/main.c
  rcu_periph_clock_enable(RCU_DMA);

  dma_deinit(DMA_CH1);
  dma_struct_para_init(&dma_para);

  dma_para.direction = DMA_MEMORY_TO_PERIPHERAL;
  dma_para.memory_addr = (uint32_t)buf;
  dma_para.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
  dma_para.memory_width = DMA_MEMORY_WIDTH_8BIT;
  dma_para.number = len;
  dma_para.periph_addr = (uint32_t)&USART_TDATA(USART0);
  dma_para.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
  dma_para.periph_width = DMA_PERIPHERAL_WIDTH_8BIT;
  dma_para.priority = DMA_PRIORITY_HIGH;
  dma_init(DMA_CH1, &dma_para);

  dma_circulation_disable(DMA_CH1);
  dma_memory_to_memory_disable(DMA_CH1);

  usart0_tx_busy = 1;

  /* 使能 DMA 传输完成中断，用于清除 busy 标志 */
  dma_interrupt_enable(DMA_CH1, DMA_INT_FTF);
  nvic_irq_enable(DMA_Channel1_2_IRQn, 0, 1);

  usart_dma_transmit_config(USART0, USART_TRANSMIT_DMA_ENABLE);
  dma_channel_enable(DMA_CH1);
}

/**
 * @brief DMA 发送完成中断（DMA_CH1 与 DMA_CH2 共用）
 * 清除 usart0_tx_busy，允许下一帧发送
 */
void DMA_Channel1_2_IRQHandler(void) {
  if (dma_interrupt_flag_get(DMA_CH1, DMA_INT_FLAG_FTF) == SET) {
    dma_interrupt_flag_clear(DMA_CH1, DMA_INT_FLAG_FTF);
    dma_channel_disable(DMA_CH1);
    usart_dma_transmit_config(USART0, USART_TRANSMIT_DMA_DISABLE);
    usart0_tx_busy = 0;
  }

  if (dma_interrupt_flag_get(DMA_CH2, DMA_INT_FLAG_FTF) == SET) {
    dma_interrupt_flag_clear(DMA_CH2, DMA_INT_FLAG_FTF);
  }
}

void timer_config(void) {
  timer_parameter_struct timer_initpara;

  /* 1. 使能 TIMER1 时钟 */
  rcu_periph_clock_enable(RCU_TIMER1);

  /* 2. 复位 TIMER1 */
  timer_deinit(TIMER1);

  /* 3. 配置 TIMER1 时基单元 */
  timer_struct_para_init(&timer_initpara);
  /* 定时器时钟 = 84MHz / 8400 = 10kHz；
     重装载值由采样频率派生（须能整除，否则需同步调整预分频） */
  timer_initpara.prescaler =
      8400 - 1; // 预分频值 (系统时钟84MHz，分频后为10kHz)
  timer_initpara.alignedmode = TIMER_COUNTER_EDGE;    // 边缘对齐模式
  timer_initpara.counterdirection = TIMER_COUNTER_UP; // 向上计数模式
  timer_initpara.period = (uint32_t)(10000.0f / SAMPLING_FREQ_HZ) -
                          1; // 自动重装载值（由采样频率派生）
  timer_initpara.clockdivision = TIMER_CKDIV_DIV1; // 时钟分频
  timer_initpara.repetitioncounter = 0;            // 重复计数器设为0
  timer_init(TIMER1, &timer_initpara);

  /* 4. 使能 TIMER1 更新中断 */
  timer_interrupt_enable(TIMER1, TIMER_INT_UP);

  /* 5. 配置 NVIC 中断优先级并使能中断 */
  nvic_irq_enable(TIMER1_IRQn, 0, 1);

  /* 6. 启动定时器 */
  timer_enable(TIMER1);
}

/************************ 软I2C诊断（验证0x68器件用，确认后可删除）
 * ************************/
static void diag_scl(uint8_t level) {
  if (level)
    gpio_bit_set(GPIOA, GPIO_PIN_0);
  else
    gpio_bit_reset(GPIOA, GPIO_PIN_0);
}
static void diag_sda(uint8_t level) {
  if (level)
    gpio_bit_set(GPIOA, GPIO_PIN_1);
  else
    gpio_bit_reset(GPIOA, GPIO_PIN_1);
}
static uint8_t diag_sda_in(void) {
  return gpio_input_bit_get(GPIOA, GPIO_PIN_1);
}
static void diag_start(void) {
  diag_sda(1);
  diag_scl(1);
  delay_us(5);
  diag_sda(0);
  delay_us(5);
  diag_scl(0);
  delay_us(5);
}
static void diag_stop(void) {
  diag_sda(0);
  diag_scl(1);
  delay_us(5);
  diag_sda(1);
  delay_us(5);
}
static uint8_t diag_send_byte(uint8_t byte) {
  uint8_t i, ack;
  for (i = 0; i < 8; i++) {
    diag_scl(0);
    delay_us(3);
    if (byte & 0x80)
      diag_sda(1);
    else
      diag_sda(0);
    delay_us(2);
    diag_scl(1);
    delay_us(5);
    byte <<= 1;
  }
  diag_scl(0);
  delay_us(3);
  diag_sda(1);
  delay_us(2);
  diag_scl(1);
  delay_us(5);
  ack = diag_sda_in(); /* 0=器件拉低SDA=ACK, 1=NACK */
  diag_scl(0);
  delay_us(5);
  return (ack == 0) ? 0 : 1;
}
/* 诊断用读字节函数，已注释
static uint8_t diag_read_byte(uint8_t ack_bit) {
  uint8_t i, byte = 0;
  diag_sda(1);
  for (i = 0; i < 8; i++) {
    diag_scl(0); delay_us(5);
    diag_scl(1); delay_us(3);
    byte <<= 1;
    if (diag_sda_in()) byte |= 0x01;
    delay_us(2);
  }
  diag_scl(0); delay_us(3);
  if (ack_bit) diag_sda(0); else diag_sda(1);
  delay_us(2); diag_scl(1); delay_us(5);
  diag_scl(0); delay_us(5);
  return byte;
}
*/
static void diag_reg_write(uint8_t dev, uint8_t reg, uint8_t data) {
  diag_start();
  diag_send_byte(dev << 1);
  diag_send_byte(reg);
  diag_send_byte(data);
  diag_stop();
}
/* 开机软I2C读WHO_AM_I诊断（调试用，已注释，正式运行不需要） */
// static void soft_i2c_whoami_diag(void) {
//   uint8_t ack_w, ack_reg, ack_r, who;
//
//   printf("\r\n[DIAG] Soft-I2C read WHO_AM_I: dev=0x68 reg=0x75 ...\r\n");
//
//   gpio_mode_set(GPIOA, GPIO_MODE_OUTPUT, GPIO_PUPD_PULLUP, GPIO_PIN_0 |
//   GPIO_PIN_1); gpio_output_options_set(GPIOA, GPIO_OTYPE_OD,
//   GPIO_OSPEED_50MHZ, GPIO_PIN_0 | GPIO_PIN_1); diag_scl(1); diag_sda(1);
//   delay_1ms(2);
//
//   diag_start();
//   ack_w   = diag_send_byte(0x68 << 1);       /* 写地址 0xD0 */
//   ack_reg = diag_send_byte(0x75);            /* 寄存器 0x75 */
//   diag_start();                              /* RESTART */
//   ack_r   = diag_send_byte((0x68 << 1) | 1); /* 读地址 0xD1 */
//   who = diag_read_byte(0);                   /* 读1字节 + NACK */
//   diag_stop();
//
//   printf("[DIAG] ACK: addrW=%s reg=%s addrR=%s | WHO_AM_I=0x%02X %s\r\n",
//          ack_w ? "NACK" : "ACK", ack_reg ? "NACK" : "ACK", ack_r ? "NACK" :
//          "ACK", who, (who == 0x67) ? "(OK 0x67)" : "(NOT 0x67!)");
// }

int main(void) {

  /* App 链接在 0x08002000（bootloader 之后），启动必须把中断向量表重定位到 App
   * 区 */
  SCB->VTOR = 0x08002000U;

  /* bootloader 跳转前调用了 __disable_irq() 关掉全局中断，必须恢复，
     否则 SysTick 中断不触发 → delay_1ms()/delay_ms() 会死循环卡死 */
  __enable_irq();

  systick_config();
  com_usart_init();
  printf("%x", main);
  printf("[APP] started\r\n");

  // soft_i2c_whoami_diag();   /*
  // 开机软I2C读WHO_AM_I诊断：调试用，正式运行注释掉 */ printf("Hellow
  // word!\n"); sprintf(transmitter_buffer, "HELLO_world!\n");
  // usart_interrupt_enable(USART0, USART_INT_TBE);
  // delay_1ms(10);

  // txcount = 0;
  // usart_interrupt_enable(USART0, USART_INT_TBE);
  // printf("hello_word");
  /* configure RCU */
  /* I2C1 硬件初始化（hard_i2c_init 内部已配置 GPIO 和 I2C1 外设） */
  hard_i2c_init();

  /* I2C总线扫描 - 检测设备是否存在（调试用，正式运行注释掉）
  printf("=== I2C Bus Scan ===\n");
  for(uint8_t addr = 0x08; addr <= 0x77; addr++) {
    if(hard_i2c_probe(addr) == 0) {
      printf("  Device found at 7-bit addr: 0x%02X (8-bit: 0x%02X)\n", addr,
  addr << 1);
    }
  }
  printf("=== Scan Done ===\n");
  */
  // printf("I2C init done!\n");

