chipskiller/ahrs_test/GD32F3x0_Firmware_Library_V2.6.0/GD32F3x0_Firmware_Library_V2.6.0/GD32F3x0_Firmware_Library_V2.6.0/Template/main.c
  // i2c_test();

  // // soft_i2c_test();

  // gpio_config();
  // i2c_config();

  // i2c_test();

  imu_system_init();
  usart0_rx_dma_idle_init(); /* 配置USART0 DMA接收 + 空闲中断 */
  timer_config();
  // printf("timer init done!\n");

  static uint32_t rate_cnt = 0;
  while (1) {

    if (imu_debug_flag) {
      imu_debug_flag = 0;
      // printf("temp=%.4f, yaw=%.4f, roll=%.4f\r\n", icm_raw.temp, att.yaw_now, att.roll);
      // printf("55 00 EE T=%.3f  gz_raw=%.3f\r\n", icm_raw.temp, icm_raw.gx);
      // printf("rate_cnt=%d\n", rate_cnt);
      rate_cnt = 0;
    }
    if (imu_loop_flag) {
      rate_cnt++;
      imu_main_loop(12);
      imu_loop_flag = 0;

      // debug_cnt++;
      // /* 0x82 与 0x8E 错开 500ms 发送：
      //    proto_send 对 usart0_tx_busy 是"直接丢弃"而非等待，
      //    背靠背连发会导致第二帧被丢弃 */
      // if (debug_cnt % 1000 == 0) {
      //   proto_send(0x82);
      // } else if (debug_cnt % 1000 == 500) {
      //   proto_send(0x8E);
      // }

      // printf("imu_tmp = %.4f\r\n", icm_raw.temp);
      // printf("mag_norm=%.4f,mag_x=%.4f,mag_y=%.4f,mag_z=%.4f\n",
      //        mag_raw.mag_norm, mag_raw.mx, mag_raw.my, mag_raw.mz);
      // printf("P=%.4f,R=%.4f,Y=%.4f\r\n", att.pitch, att.roll, att.yaw_now);
      // printf("ax=%.4f,ay=%.4f,az=%.4f\r\ngx=%.4f,gy=%.4f,gz=%.4f\r\n",
      //        icm_raw.ax, icm_raw.ay, icm_raw.az, icm_raw.gx, icm_raw.gy,
      //        icm_raw.gz);
      // printf("gx=%.4f,gy=%.4f,gz=%.4f\r\n", icm_raw.gx, icm_raw.gy,
      //        icm_raw.gz);
    }

    // 处理串口数据（空闲中断已计算 usart0_rx_len）
    if (usart0_rx_flag) {
      usart0_rx_flag = 0;
      if (usart0_rx_len >= 3) {
        uint8_t rx_cmd = usart0_rx_buffer[2];
        if (rx_cmd >= 0xF0) {
          /* OTA 远程烧录协议 */
          // printf("[DBG] ota_rx: len=%u b=%02X %02X %02X %02X %02X %02X\r\n",
          //        usart0_rx_len, usart0_rx_buffer[0], usart0_rx_buffer[1],
          //        usart0_rx_buffer[2], usart0_rx_buffer[3],
          //        usart0_rx_buffer[4], usart0_rx_buffer[5]);
          for (uint16_t i = 0; i < usart0_rx_len; i++) {
            ota_protocol_parse(usart0_rx_buffer[i]);
          }
        } else {
          /* 原有业务协议 */
          uint8_t calc_cs =
              calc_checksum(usart0_rx_buffer + 1, usart0_rx_len - 2);
          if (calc_cs != usart0_rx_buffer[usart0_rx_len - 1]) {
            /* 校验失败，丢弃此帧 */
          } else {
            proto_send(usart0_rx_buffer[2]);
          }
        }
      }
    }
  }
}